### 1070. Product Sales Analysis III

Write a solution to find all sales that occurred in the first year each product was sold.

For each product_id, identify the earliest year it appears in the Sales table.

Return all sales entries for that product in that year.

Return a table with the following columns: product_id, first_year, quantity, and price.
Return the result in any order.

In [2]:
import pandas as pd

In [ ]:
data = [[1, 100, 2008, 10, 5000], [2, 100, 2009, 12, 5000], [7, 200, 2011, 15, 9000]]
sales = pd.DataFrame(data, columns=['sale_id', 'product_id', 'year', 'quantity', 'price']).astype({'sale_id':'Int64', 'product_id':'Int64', 'year':'Int64', 'quantity':'Int64', 'price':'Int64'})
sales

   sale_id  product_id  year  quantity  price
0        1         100  2008        10   5000
1        2         100  2009        12   5000
2        7         200  2011        15   9000

In [16]:
sales.sort_values(['product_id', 'year'], inplace=True)
ans = sales.drop_duplicates('product_id', keep='first')
ans.rename(columns={'year': 'first_year'}, inplace=True)
ans[['product_id', 'first_year', 'quantity', 'price']]

C:\Users\User\AppData\Local\Temp\ipykernel_18864\1249209974.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ans.rename(columns={'year': 'first_year'}, inplace=True)

   product_id  first_year  quantity  price
0         100        2008        10   5000
2         200        2011        15   9000

In [17]:
first_years = sales.groupby('product_id')['year'].transform('min')
ans = (sales[sales['year'] == first_years]
       .drop_duplicates('product_id')
       .rename(columns={'year': 'first_year'})
       [['product_id', 'first_year', 'quantity', 'price']])
ans

   product_id  first_year  quantity  price
0         100        2008        10   5000
2         200        2011        15   9000

### 1075. Project Employees I

Write an SQL query that reports the average experience years of all the employees for each project, rounded to 2 digits.

Return the result table in any order.

The query result format is in the following example.

In [18]:
data = [[1, 1], [1, 2], [1, 3], [2, 1], [2, 4]]
project = pd.DataFrame(data, columns=['project_id', 'employee_id']).astype({'project_id':'Int64', 'employee_id':'Int64'})
data = [[1, 'Khaled', 3], [2, 'Ali', 2], [3, 'John', 1], [4, 'Doe', 2]]
employee = pd.DataFrame(data, columns=['employee_id', 'name', 'experience_years']).astype({'employee_id':'Int64', 'name':'object', 'experience_years':'Int64'})

display(project)
display(employee)

   project_id  employee_id
0           1            1
1           1            2
2           1            3
3           2            1
4           2            4

   employee_id    name  experience_years
0            1  Khaled                 3
1            2     Ali                 2
2            3    John                 1
3            4     Doe                 2

In [ ]:
a = pd.DataFrame([1,2])
b = a.__deepcopy__()
b

AttributeError: 'list' object has no attribute '__deepcopy__'